In [1]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in /usr/local/anaconda3/lib/python3.8/site-packages (2.8.6)

In [2]:
# Dependencies and Setup
#SQL Alchemy
from sqlalchemy import create_engine

# Pandas
import pandas as pd

# Matplotlib
import matplotlib.pyplot as plt

# NumPy
import numpy as np
import scipy.stats as sts
import psycopg2

In [4]:
# Create Engine and Pass in Postgres Connection
# Setup to Connect to Database 

username="postgres"
password="lotie"
db_name="Employee_db"
hostname="localhost"
engine = create_engine(f'postgresql://{username}:{password}@{hostname}:5433/{db_name}')
connection = engine.connect()
'''
---------------------------------
engine = create_engine('postgres://postgres:password123@localhost:5432/employee_db')
conn = engine.connect()

engine = create_engine('postgresql://localhost:5432/Employeedb(Complete_query)')
connection = engine.connect()'''

"\n---------------------------------\nengine = create_engine('postgres://postgres:password123@localhost:5432/employee_db')\nconn = engine.connect()\n\nengine = create_engine('postgresql://localhost:5432/Employeedb(Complete_query)')\nconnection = engine.connect()"

In [9]:
employees_salaries = pd.read_sql("select T.title, S.salary from employees E join salaries S on E.emp_no = S.emp_no join titles T on E.emp_title_id = T.title_id ", connection)
employees_salaries.head()

              title  salary
0          Engineer   48973
1   Senior Engineer   40000
2  Technique Leader   43548
3             Staff   63377
4   Senior Engineer   40000

In [8]:
p.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development